# Brewfile
# https://github.com/Homebrew/homebrew-bundle
# https://coderwall.com/p/afmnbq/homebrew-s-new-feature-brewfiles
#
# Run by executing `brew bundle`

brew 'ack'
brew 'vim' 
brew 'macvim', args: ['with-override-system-vim']
brew 'rbenv'
brew 'zsh'
brew 'zsh-completions'
brew 'nvm'

brew 'mas' # Required for Mac App Store installs from Brewfile

cask 'evernote'
cask 'launchbar'
cask 'textexpander'
cask 'iterm2'
cask 'launchrocket'

# https://github.com/sindresorhus/quick-look-plugins
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'qlstephen'          # Various text files
cask 'betterzipql'        # List zip contents
cask 'qlimagesize'        # Display image size / resolution
cask 'suspicious-package' # Inspect .pkg files
cask 'provisionql'        # Inspect IPA files
cask 'quicklookapk'       # Inspect APK files

# mas 'Wunderlist', id: 410628904
